src/domain/sci/transporter/broker/mr/MrCreateLabel.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.mondialrelay.fr/webservice/">
  <soapenv:Header/>
  <soapenv:Body>
    <web:WSI2_CreationEtiquette>
      <!--Optional:-->
      <web:Enseigne>BDTEST13</web:Enseigne>
      <!--Optional:-->
      <web:ModeCol>CCC</web:ModeCol>
      <!--Optional:-->
      <web:ModeLiv>24R</web:ModeLiv>
      <!--Optional:-->
      <web:NDossier>ClientOrder</web:NDossier>
      <!--Optional:-->
      <web:NClient>ClientRef</web:NClient>
      <!--Optional:-->
      <web:Expe_Langage>FR</web:Expe_Langage>
      <!--Optional:-->
      <web:Expe_Ad1>SAddress1</web:Expe_Ad1>
      <!--Optional:-->
      <web:Expe_Ad2>SAddress2</web:Expe_Ad2>
      <!--Optional:-->
      <web:Expe_Ad3>SAddress3</web:Expe_Ad3>
      <!--Optional:-->
      <web:Expe_Ad4>SAddress4</web:Expe_Ad4>
      <!--Optional:-->
      <web:Expe_Ville>Paris</web:Expe_Ville>
      <!--Optional:-->
      <web:Expe_CP>75000</web:Expe_CP>
      <!--Optional:-->
      <web:Expe_Pays>FR</web:Expe_Pays>
      <!--Optional:-->
      <web:Expe_Tel1>0651042196</web:Expe_Tel1>
      <!--Optional:-->
      <web:Expe_Tel2></web:Expe_Tel2>
      <!--Optional:-->
      <web:Expe_Mail>longweiquan@gmail.com</web:Expe_Mail>
      <!--Optional:-->
      <web:Dest_Langage>FR</web:Dest_Langage>
      <!--Optional:-->
      <web:Dest_Ad1>RAddress1</web:Dest_Ad1>
      <!--Optional:-->
      <web:Dest_Ad2>RAddress2</web:Dest_Ad2>
      <!--Optional:-->
      <web:Dest_Ad3>RAddress3</web:Dest_Ad3>
      <!--Optional:-->
      <web:Dest_Ad4>RAddress4</web:Dest_Ad4>
      <!--Optional:-->
      <web:Dest_Ville>Paris</web:Dest_Ville>
      <!--Optional:-->
      <web:Dest_CP>75000</web:Dest_CP>
      <!--Optional:-->
      <web:Dest_Pays>FR</web:Dest_Pays>
      <!--Optional:-->
      <web:Dest_Tel1>0651042196</web:Dest_Tel1>
      <!--Optional:-->
      <web:Dest_Tel2></web:Dest_Tel2>
      <!--Optional:-->
      <web:Dest_Mail>longweiquan@gmail.com</web:Dest_Mail>
      <!--Optional:-->
      <web:Poids>15</web:Poids>
      <!--Optional:-->
      <web:Longueur>10</web:Longueur>
      <!--Optional:-->
      <web:Taille></web:Taille>
      <!--Optional:-->
      <web:NbColis>1</web:NbColis>
      <!--Optional:-->
      <web:CRT_Valeur>0</web:CRT_Valeur>
      <!--Optional:-->
      <web:CRT_Devise></web:CRT_Devise>
      <!--Optional:-->
      <web:Exp_Valeur>10</web:Exp_Valeur>
      <!--Optional:-->
      <web:Exp_Devise>EUR</web:Exp_Devise>
      <!--Optional:-->
      <web:COL_Rel_Pays></web:COL_Rel_Pays>
      <!--Optional:-->
      <web:COL_Rel></web:COL_Rel>
      <!--Optional:-->
      <web:LIV_Rel_Pays>FR</web:LIV_Rel_Pays>
      <!--Optional:-->
      <web:LIV_Rel>003973</web:LIV_Rel>
      <!--Optional:-->
      <web:TAvisage>O</web:TAvisage>
      <!--Optional:-->
      <web:TReprise>N</web:TReprise>
      <!--Optional:-->
      <web:Montage>0</web:Montage>
      <!--Optional:-->
      <web:TRDV>N</web:TRDV>
      <!--Optional:-->
      <web:Assurance>0</web:Assurance>
      <!--Optional:-->
      <web:Instructions>instructions</web:Instructions>
      <!--Optional:-->
      <web:Security>9987831F9DBADB6B4E8478F0F29D1931</web:Security>
      <!--Optional:-->
      <web:Texte></web:Texte>
    </web:WSI2_CreationEtiquette>
  </soapenv:Body>
</soapenv:Envelope>
